{
  "backend/main.mo": "Main Motoko actor for the prom dress marketplace, implementing user profile management, dress listing CRUD operations, and messaging between buyers and sellers with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting two completed homepage changes: removal of '500 happy buyers' and '60% savings' stat elements, and updating the background color from white to cream (#FFFDF7).",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing each component's purpose and notable styling or bug-fix details.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including backgrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the React app titled 'Prom Dress Marketplace' that mounts the app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with routes for home, browse, listing detail, and dashboard pages, and includes an AppShell that conditionally shows the profile setup modal for authenticated users without a profile.",
  "frontend/src/components/CreateListingForm.tsx": "Form component for creating new dress listings with fields for title, price, size, condition, color, and up to 5 photo uploads with progress tracking, using the useAddListing hook and dark brown button styling.",
  "frontend/src/components/EditListingForm.tsx": "Form component for editing existing dress listings, pre-populated with current listing data, supporting new photo uploads and toggling existing photo retention, with dark brown save button styling.",
  "frontend/src/components/FilterChips.tsx": "Renders active search/filter chips (keyword, size, color, condition, price range) with individual remove buttons and a clear-all option.",
  "frontend/src/components/Footer.tsx": "Site footer with branding, quick navigation links, an about blurb, copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation links, and Internet Identity login/logout functionality.",
  "frontend/src/components/InquiriesPanel.tsx": "Displays a list of buyer inquiry messages for a given listing, with loading skeletons and empty/error states.",
  "frontend/src/components/InquiryForm.tsx": "Form that allows authenticated users to send a message to a dress listing's seller, prompting unauthenticated users to sign in first.",
  "frontend/src/components/Layout.tsx": "Wraps page content with the shared Header and Footer inside a full-height flex column layout.",
  "frontend/src/components/ListingCard.tsx": "Card component displaying a dress listing's photo, title, condition badge, size, color, and price with a link to the listing detail page.",
  "frontend/src/components/ListingManagementCard.tsx": "Seller-facing card for managing a dress listing, providing edit, delete, promote-to-featured, and toggle-messages actions.",
  "frontend/src/components/PhotoGallery.tsx": "A photo gallery component that displays a list of dress photos with prev/next navigation buttons, dot indicators, and a thumbnail strip for multi-photo listings.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time users to set up their profile by entering a name, selecting a buyer/seller role, and optionally adding a bio, then saving via a mutation hook.",
  "frontend/src/components/SearchBar.tsx": "A search bar component with a keyword input and a collapsible filter panel supporting size, color, condition, and price range filters, invoking an onSearch callback with the active filters.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, exposing login/logout functions and identity/status state via React context.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the app, covering user profile CRUD, dress listing queries and mutations (add, update, delete, search), and messaging operations against the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display, Lato), sets up Tailwind directives, defines light/dark CSS custom properties using oklch colors, and adds a global dark-brown button override component layer.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts it to the DOM.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Page component for browsing dress listings with search, multi-filter (size, color, condition, price range), and pagination support, fetching data via useGetAllListings.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero image carousel with search bar, recent listings, and featured listings sections, using brown-themed button and link components.",
  "frontend/src/pages/ListingDetailPage.tsx": "Detail page for a single dress listing showing a photo gallery, listing metadata, and a message form allowing authenticated buyers to contact the seller.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Authenticated seller dashboard displaying listing stats and a list of the seller's listings, with dialogs for creating and editing listings.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts (Cormorant Garamond, Lato), a rose-gold/champagne/ivory color palette using oklch values, custom shadows, border radii, and animation keyframes. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the current state of the prom dress marketplace project at version 15, listing existing features (homepage, browse/search, listing detail, seller dashboard, visual theme, hero image, button color changes), architectural notes, and known issues."
}